self/case4/pimple_spline/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       11830;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       11880;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          240;
        startFace       11930;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12000;
        startFace       12170;
    }
)

// ************************************************************************* //
